import pandas as pd

students = {
    "Іваненко Іван Іванович": {
        "Група": 101,
        "Курс": 2,
        "Оцінки": {"Програмування мовою Python": 85, "Моделювання систем": 78},
        "Стать": 'чоловік',
        "Допуск до сесії": 'так'
    },
    "Петров Петро Петрович": {
        "Група": 102,
        "Курс": 3,
        "Оцінки": {"Програмування мовою Python": 90, "Моделювання систем": 82},
        "Стать": 'чоловік',
        "Допуск до сесії": 'ні'
    },
    "Сидоренко Марія Олександрівна": {
        "Група": 101,
        "Курс": 2,
        "Оцінки": {"Програмування мовою Python": 88, "Моделювання систем": 76},
        "Стать": 'жінка',
        "Допуск до сесії": 'так'
    },
    "Кумша Олег Васильович": {
        "Група": 103,
        "Курс": 1,
        "Оцінки": {"Програмування мовою Python": 80, "Моделювання систем": 85},
        "Стать": 'чоловік',
        "Допуск до сесії": 'ні'
    },
    "Недозименко Андрій Павлович": {
        "Група": 102,
        "Курс": 3,
        "Оцінки": {"Програмування мовою Python": 86, "Моделювання систем": 80},
        "Стать": 'чоловік',
        "Допуск до сесії": 'так'
    },
    "Кирилко Володимир Вікторович": {
        "Група": 101,
        "Курс": 2,
        "Оцінки": {"Програмування мовою Python": 83, "Моделювання систем": 77},
        "Стать": 'чоловік',
        "Допуск до сесії": 'так'
    },
    "Бухтіяров Сергій Олександрович": {
        "Група": 103,
        "Курс": 1,
        "Оцінки": {"Програмування мовою Python": 81, "Моделювання систем": 79},
        "Стать": 'чоловік',
        "Допуск до сесії": 'так'
    },
    "Волок Дмитро Ігорович": {
        "Група": 101,
        "Курс": 2,
        "Оцінки": {"Програмування мовою Python": 87, "Моделювання систем": 81},
        "Стать": 'чоловік',
        "Допуск до сесії": 'так'
    }
}

data = []
for student, info in students.items():
    row = {
    "Ім'я": student,
    "Група": info["Група"],
    "Курс": info["Курс"],
    "Стать": info["Стать"],
    "Допуск до сесії": info["Допуск до сесії"]
    }
    row.update(info["Оцінки"])
    data.append(row)

df = pd.DataFrame(data)
df["Оцінки"] = df["Програмування мовою Python"] + df["Моделювання систем"]

print("Датафрейм з інформацією про студентів:")
print(df)

grouped_by_group = df.groupby("Група")[["Програмування мовою Python", "Моделювання систем"]].mean()
print(f"\nСередні оцінки за групами:\n{grouped_by_group}")

grouped_by_course = df.groupby("Курс")[["Програмування мовою Python", "Моделювання систем"]].mean()
print(f"\nСередні оцінки за курсами:\n{grouped_by_course}")

grouped_by_students = df.groupby("Ім'я")[["Оцінки"]].max()
print(f"\nСума оцінок по студентам:\n{grouped_by_students}")

admission_counts = df.pivot_table(
    index="Курс",
    columns="Допуск до сесії",
    aggfunc="size",
    fill_value=0
)
print(f"\nПідрахунок допуску до сесії за курсами:\n{admission_counts}")